        potato_low = np.array([160, 165, 80])                                                                     # Параметры необходимые для определения облака точек каждого цвета:
        potato_high = np.array([180, 210, 185])																      # Красного

        water_low = np.array([106,65,62])                                                                         # Синего
        water_high = np.array([130,255,255])

        seed_low = np.array([15, 65, 90])                                                                         # И желтого
        seed_high = np.array([41, 220, 240])

        pastures_low = np.array([65,86,42])                                                                       # И зеленого
        pastures_high = np.array([95,255,99])
     
        soil_low = np.array([0,90,55])                                                                            # И коричневого
        soil_high = np.array([15,165,150])
		
		img = cv2.undistort( img,np.array([[166.23942373073172,0,162.19011246829268],[0,166.5880923974026,109.82227735714285],[0,0,1]]), np.array([2.15356885e-01,-1.17472846e-01,-3.06197672e-04,-1.09444025e-04,-4.53657258e-03,5.73090623e-01,-1.27574577e-01,-2.86125589e-02]))
